log/benchmark/jruby_9_2_6_0.log
+ for request_path in /posts /posts.json /posts/1 /posts/1.json
+ sleep 12
+ JAVA_HOME=/opt/jdk-11.0.2
+ jruby.bash -v /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +jit [linux-x86_64]
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.jruby.ext.openssl.SecurityHelper (file:/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/lib/ruby/stdlib/jopenssl.jar) to constructor java.security.cert.CertificateFactory(java.security.cert.CertificateFactorySpi,java.security.Provider,java.lang.String)
WARNING: Please consider reporting this to the maintainers of org.jruby.ext.openssl.SecurityHelper
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Puma starting in single mode...
* Version 3.12.0 (jruby 9.2.6.0 - ruby 2.5.3), codename: Llamas in Pajamas
* Min threads: 4, max threads: 4
* Environment: production
[bootsnap/setup] Load path caching is not supported on this implementation of Ruby
[bootsnap/setup] bytecode caching is not supported on this implementation of Ruby
[bootsnap/setup] YAML parsing caching is not supported on this implementation of Ruby
* Listening on tcp://0.0.0.0:3000
Use Ctrl-C to stop
+ ab -n 10000 -c 4 localhost:3000/posts
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts
Document Length:        52719 bytes

Concurrency Level:      4
Time taken for tests:   66.462 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      534224538 bytes
HTML transferred:       527190000 bytes
Requests per second:    150.46 [#/sec] (mean)
Time per request:       26.585 [ms] (mean)
Time per request:       6.646 [ms] (mean, across all concurrent requests)
Transfer rate:          7849.61 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:    16   26  19.5     24     844
Waiting:       15   26  19.3     23     839
Total:         16   27  19.5     24     844

Percentage of the requests served within a certain time (ms)
  50%     24
  66%     29
  75%     30
  80%     31
  90%     34
  95%     39
  98%     53
  99%     70
 100%    844 (longest request)
+ ab -n 1000 -c 4 localhost:3000/posts
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts
Document Length:        52719 bytes

Concurrency Level:      4
Time taken for tests:   5.169 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      53422148 bytes
HTML transferred:       52719000 bytes
Requests per second:    193.46 [#/sec] (mean)
Time per request:       20.676 [ms] (mean)
Time per request:       5.169 [ms] (mean, across all concurrent requests)
Transfer rate:          10092.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    16   21   4.9     18      40
Waiting:       15   20   4.8     17      39
Total:         16   21   4.9     18      41

Percentage of the requests served within a certain time (ms)
  50%     18
  66%     21
  75%     26
  80%     26
  90%     28
  95%     29
  98%     32
  99%     34
 100%     41 (longest request)
+ pkill -9 java
+ sleep 5
/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/jruby.bash: line 452: 12871 Killed                  "$JAVACMD" $PROFILE_ARGS $JAVA_OPTS "$JFFI_OPTS" "${java_args[@]}" ${classmod_flag} "$JRUBY_CP$CP_DELIMITER$CP$CP_DELIMITER$CLASSPATH" "-Djruby.home=$JRUBY_HOME" "-Djruby.lib=$JRUBY_HOME/lib" -Djruby.script=jruby "-Djruby.shell=$JRUBY_SHELL" $java_class $mode "$@"
+ for request_path in /posts /posts.json /posts/1 /posts/1.json
+ sleep 12
+ JAVA_HOME=/opt/jdk-11.0.2
+ jruby.bash -v /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +jit [linux-x86_64]
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.jruby.ext.openssl.SecurityHelper (file:/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/lib/ruby/stdlib/jopenssl.jar) to constructor java.security.cert.CertificateFactory(java.security.cert.CertificateFactorySpi,java.security.Provider,java.lang.String)
WARNING: Please consider reporting this to the maintainers of org.jruby.ext.openssl.SecurityHelper
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Puma starting in single mode...
* Version 3.12.0 (jruby 9.2.6.0 - ruby 2.5.3), codename: Llamas in Pajamas
* Min threads: 4, max threads: 4
* Environment: production
[bootsnap/setup] Load path caching is not supported on this implementation of Ruby
[bootsnap/setup] bytecode caching is not supported on this implementation of Ruby
[bootsnap/setup] YAML parsing caching is not supported on this implementation of Ruby
* Listening on tcp://0.0.0.0:3000
Use Ctrl-C to stop
+ ab -n 10000 -c 4 localhost:3000/posts.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts.json
Document Length:        39548 bytes

Concurrency Level:      4
Time taken for tests:   99.397 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      399970000 bytes
HTML transferred:       395480000 bytes
Requests per second:    100.61 [#/sec] (mean)
Time per request:       39.759 [ms] (mean)
Time per request:       9.940 [ms] (mean, across all concurrent requests)
Transfer rate:          3929.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    30   40  28.2     34    1168
Waiting:       30   39  28.1     34    1167
Total:         30   40  28.2     34    1168

Percentage of the requests served within a certain time (ms)
  50%     34
  66%     36
  75%     39
  80%     43
  90%     49
  95%     54
  98%     88
  99%    115
 100%   1168 (longest request)
+ ab -n 1000 -c 4 localhost:3000/posts.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts.json
Document Length:        39548 bytes

Concurrency Level:      4
Time taken for tests:   8.371 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      39997000 bytes
HTML transferred:       39548000 bytes
Requests per second:    119.46 [#/sec] (mean)
Time per request:       33.485 [ms] (mean)
Time per request:       8.371 [ms] (mean, across all concurrent requests)
Transfer rate:          4665.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    30   33   4.4     31      56
Waiting:       30   33   4.3     31      55
Total:         30   33   4.4     31      56

Percentage of the requests served within a certain time (ms)
  50%     31
  66%     32
  75%     34
  80%     35
  90%     40
  95%     45
  98%     47
  99%     50
 100%     56 (longest request)
+ pkill -9 java
+ sleep 5
/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/jruby.bash: line 452: 13645 Killed                  "$JAVACMD" $PROFILE_ARGS $JAVA_OPTS "$JFFI_OPTS" "${java_args[@]}" ${classmod_flag} "$JRUBY_CP$CP_DELIMITER$CP$CP_DELIMITER$CLASSPATH" "-Djruby.home=$JRUBY_HOME" "-Djruby.lib=$JRUBY_HOME/lib" -Djruby.script=jruby "-Djruby.shell=$JRUBY_SHELL" $java_class $mode "$@"
+ for request_path in /posts /posts.json /posts/1 /posts/1.json
+ sleep 12
+ JAVA_HOME=/opt/jdk-11.0.2
+ jruby.bash -v /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +jit [linux-x86_64]
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.jruby.ext.openssl.SecurityHelper (file:/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/lib/ruby/stdlib/jopenssl.jar) to constructor java.security.cert.CertificateFactory(java.security.cert.CertificateFactorySpi,java.security.Provider,java.lang.String)
WARNING: Please consider reporting this to the maintainers of org.jruby.ext.openssl.SecurityHelper
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Puma starting in single mode...
* Version 3.12.0 (jruby 9.2.6.0 - ruby 2.5.3), codename: Llamas in Pajamas
* Min threads: 4, max threads: 4
* Environment: production
[bootsnap/setup] Load path caching is not supported on this implementation of Ruby
[bootsnap/setup] bytecode caching is not supported on this implementation of Ruby
[bootsnap/setup] YAML parsing caching is not supported on this implementation of Ruby
* Listening on tcp://0.0.0.0:3000
Use Ctrl-C to stop
+ ab -n 10000 -c 4 localhost:3000/posts/1
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
apr_pollset_poll: The timeout specified has expired (70007)
+ ab -n 1000 -c 4 localhost:3000/posts/1
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
apr_pollset_poll: The timeout specified has expired (70007)
+ pkill -9 java
+ sleep 5
/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/jruby.bash: line 452: 14638 Killed                  "$JAVACMD" $PROFILE_ARGS $JAVA_OPTS "$JFFI_OPTS" "${java_args[@]}" ${classmod_flag} "$JRUBY_CP$CP_DELIMITER$CP$CP_DELIMITER$CLASSPATH" "-Djruby.home=$JRUBY_HOME" "-Djruby.lib=$JRUBY_HOME/lib" -Djruby.script=jruby "-Djruby.shell=$JRUBY_SHELL" $java_class $mode "$@"
+ for request_path in /posts /posts.json /posts/1 /posts/1.json
+ sleep 12
+ JAVA_HOME=/opt/jdk-11.0.2
+ jruby.bash -v /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +jit [linux-x86_64]
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.jruby.ext.openssl.SecurityHelper (file:/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/lib/ruby/stdlib/jopenssl.jar) to constructor java.security.cert.CertificateFactory(java.security.cert.CertificateFactorySpi,java.security.Provider,java.lang.String)
WARNING: Please consider reporting this to the maintainers of org.jruby.ext.openssl.SecurityHelper
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Puma starting in single mode...
* Version 3.12.0 (jruby 9.2.6.0 - ruby 2.5.3), codename: Llamas in Pajamas
* Min threads: 4, max threads: 4
* Environment: production
[bootsnap/setup] Load path caching is not supported on this implementation of Ruby
[bootsnap/setup] bytecode caching is not supported on this implementation of Ruby
[bootsnap/setup] YAML parsing caching is not supported on this implementation of Ruby
* Listening on tcp://0.0.0.0:3000
Use Ctrl-C to stop
+ ab -n 10000 -c 4 localhost:3000/posts/1.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1.json
Document Length:        279 bytes

Concurrency Level:      4
Time taken for tests:   28.928 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      7280000 bytes
HTML transferred:       2790000 bytes
Requests per second:    345.68 [#/sec] (mean)
Time per request:       11.571 [ms] (mean)
Time per request:       2.893 [ms] (mean, across all concurrent requests)
Transfer rate:          245.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     6   11  11.8      9     537
Waiting:        6   11  11.7      9     533
Total:          6   12  11.8      9     537

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     11
  75%     13
  80%     14
  90%     16
  95%     20
  98%     29
  99%     36
 100%    537 (longest request)
+ ab -n 1000 -c 4 localhost:3000/posts/1.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1.json
Document Length:        279 bytes

Concurrency Level:      4
Time taken for tests:   2.287 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      728000 bytes
HTML transferred:       279000 bytes
Requests per second:    437.24 [#/sec] (mean)
Time per request:       9.148 [ms] (mean)
Time per request:       2.287 [ms] (mean, across all concurrent requests)
Transfer rate:          310.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     6    9   2.8      8      28
Waiting:        6    9   2.8      8      28
Total:          6    9   2.9      8      28

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%      9
  80%     10
  90%     13
  95%     16
  98%     19
  99%     19
 100%     28 (longest request)
+ pkill -9 java
+ sleep 5


#
# 2nd attempt
#
+ JAVA_HOME=/opt/jdk-11.0.2
+ jruby.bash -v /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +jit [linux-x86_64]
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.jruby.ext.openssl.SecurityHelper (file:/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/lib/ruby/stdlib/jopenssl.jar) to constructor java.security.cert.CertificateFactory(java.security.cert.CertificateFactorySpi,java.security.Provider,java.lang.String)
WARNING: Please consider reporting this to the maintainers of org.jruby.ext.openssl.SecurityHelper
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Puma starting in single mode...
* Version 3.12.0 (jruby 9.2.6.0 - ruby 2.5.3), codename: Llamas in Pajamas
* Min threads: 4, max threads: 4
* Environment: production
[bootsnap/setup] Load path caching is not supported on this implementation of Ruby
[bootsnap/setup] bytecode caching is not supported on this implementation of Ruby
[bootsnap/setup] YAML parsing caching is not supported on this implementation of Ruby
* Listening on tcp://0.0.0.0:3000
Use Ctrl-C to stop
+ ab -n 10000 -c 4 localhost:3000/posts/1
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1
Document Length:        1635 bytes

Concurrency Level:      4
Time taken for tests:   29.343 seconds
Complete requests:      10000
Failed requests:        9997
   (Connect: 0, Receive: 0, Length: 9997, Exceptions: 0)
Non-2xx responses:      3
Total transferred:      16325247 bytes
HTML transferred:       9292118 bytes
Requests per second:    340.80 [#/sec] (mean)
Time per request:       11.737 [ms] (mean)
Time per request:       2.934 [ms] (mean, across all concurrent requests)
Transfer rate:          543.32 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     6   12  11.0      9     589
Waiting:        6   11  10.8      9     581
Total:          6   12  11.0      9     589

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     11
  75%     13
  80%     15
  90%     18
  95%     21
  98%     29
  99%     37
 100%    589 (longest request)
+ ab -n 1000 -c 4 localhost:3000/posts/1
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1
Document Length:        929 bytes

Concurrency Level:      4
Time taken for tests:   2.323 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      1632304 bytes
HTML transferred:       929000 bytes
Requests per second:    430.40 [#/sec] (mean)
Time per request:       9.294 [ms] (mean)
Time per request:       2.323 [ms] (mean, across all concurrent requests)
Transfer rate:          686.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     6    9   2.9      8      28
Waiting:        6    9   2.6      8      27
Total:          6    9   2.9      8      28

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%      9
  80%     10
  90%     13
  95%     15
  98%     19
  99%     22
 100%     28 (longest request)